dot.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-29 Sun 17:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DOT</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">DOT</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga439183">graph</a>
<ul>
<li><a href="#orge7f7bd8">rankdir</a></li>
<li><a href="#org936f73b">size</a></li>
<li><a href="#orgbe0fe0a">ratio</a></li>
<li><a href="#org6bba89a">rotate</a></li>
<li><a href="#orge14854f">nodesep</a></li>
<li><a href="#org7407529">ranksep</a></li>
</ul>
</li>
<li><a href="#org91323df">node</a>
<ul>
<li><a href="#org748ab10">shape</a>
<ul>
<li><a href="#org9f9a944">Polygon-based shapes</a></li>
<li><a href="#org666be16">Record-based shapes</a></li>
</ul>
</li>
<li><a href="#orgf1bd656">width</a></li>
<li><a href="#orgd247f38">height</a></li>
<li><a href="#org189a70b">label</a></li>
<li><a href="#org44ba0c4">style</a></li>
<li><a href="#org5219226">port</a></li>
</ul>
</li>
<li><a href="#orge302d2e">edge</a>
<ul>
<li><a href="#org4b26025">label</a></li>
<li><a href="#orgcaa160b">dir</a></li>
<li><a href="#org0d25944">headport/tailport</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>DOT</i> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> is a language for drawing graphs. It has three main kinds of objects, <code>graph</code>, <code>node</code> and <code>edge</code>. Each object has a variety of attributes. Given a <code>node</code> or <code>edge</code>, its attribute(s) can be set as below respectively
</p>
<div class="org-src-container">
<pre class="src src-sh">NODE_NAME [ATTRIBUTE1=VALUE1, ATTRIBUTE2=VALUE2, ...];
NODE_NAME1 -&gt; NODE_NAME2 [ATTRIBUTE1=VALUE1, ATTRIBUTE2=VALUE2, ...];
</pre>
</div>
<p>
And the default values can be specified as below. And they will take effect afterwards.
</p>
<div class="org-src-container">
<pre class="src src-sh">node [ATTRIBUTE1=VALUE1, ATTRIBUTE2=VALUE2, ...];
edge [ATTRIBUTE1=VALUE1, ATTRIBUTE2=VALUE2, ...];
</pre>
</div>
<div id="outline-container-orga439183" class="outline-2">
<h2 id="orga439183">graph</h2>
<div class="outline-text-2" id="text-orga439183">
<p>
A graph can be directed or undirected, corresponding to <code>digraph</code> and <code>graph</code>, respectively. Within a graph, a <code>subgraph</code> can be defined as a subset of nodes and edges.
</p>
</div>
<div id="outline-container-orge7f7bd8" class="outline-3">
<h3 id="orge7f7bd8">rankdir</h3>
<div class="outline-text-3" id="text-orge7f7bd8">
<ul class="org-ul">
<li><code>TB</code>: from top to bottom (default value)</li>
<li><code>BT</code>: from bottom to top</li>
<li><code>LR</code>: from left to right</li>
<li><code>RL</code>: from right to left</li>
</ul>
</div>
</div>
<div id="outline-container-org936f73b" class="outline-3">
<h3 id="org936f73b">size</h3>
<div class="outline-text-3" id="text-org936f73b">
<div class="org-src-container">
<pre class="src src-sh">size="x,y"
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe0fe0a" class="outline-3">
<h3 id="orgbe0fe0a">ratio</h3>
</div>
<div id="outline-container-org6bba89a" class="outline-3">
<h3 id="org6bba89a">rotate</h3>
</div>
<div id="outline-container-orge14854f" class="outline-3">
<h3 id="orge14854f">nodesep</h3>
<div class="outline-text-3" id="text-orge14854f">
<p>
Separation between nodes of the same rank in inches.
</p>
</div>
</div>
<div id="outline-container-org7407529" class="outline-3">
<h3 id="org7407529">ranksep</h3>
<div class="outline-text-3" id="text-org7407529">
<p>
Separation between ranks in inches.
</p>
</div>
</div>
</div>
<div id="outline-container-org91323df" class="outline-2">
<h2 id="org91323df">node</h2>
<div class="outline-text-2" id="text-org91323df">
<p>
A node is created when its name first appears in the file. A node has following attributes
</p>
</div>
<div id="outline-container-org748ab10" class="outline-3">
<h3 id="org748ab10">shape</h3>
<div class="outline-text-3" id="text-org748ab10">
<p>
Node shapes fall into two categories, polygon-based shapes and record-based shapes as below.
</p>
</div>
<div id="outline-container-org9f9a944" class="outline-4">
<h4 id="org9f9a944">Polygon-based shapes</h4>
<div class="outline-text-4" id="text-org9f9a944">
<ul class="org-ul">
<li><code>ellipse</code> (default value)</li>
<li><code>box</code></li>
<li><code>circle</code></li>
<li><code>plaintext</code>: a node without any outline</li>
<li><code>point</code>: a reduced node to display minimal content</li>
</ul>
</div>
</div>
<div id="outline-container-org666be16" class="outline-4">
<h4 id="org666be16">Record-based shapes</h4>
<div class="outline-text-4" id="text-org666be16">
<ul class="org-ul">
<li><code>record</code></li>
<li><code>Mrecord</code>: rounded corners</li>
</ul>
<p>
Record-based nodes represent recursive lists of fields, which are drawn as alternating horizontal and vertical rows of boxes. The recursive structure is determined by attribute <code>label</code> of the node.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf1bd656" class="outline-3">
<h3 id="orgf1bd656">width</h3>
<div class="outline-text-3" id="text-orgf1bd656">
<p>
The default value is 0.75
</p>
</div>
</div>
<div id="outline-container-orgd247f38" class="outline-3">
<h3 id="orgd247f38">height</h3>
<div class="outline-text-3" id="text-orgd247f38">
<p>
The default value is 0.5
</p>
</div>
</div>
<div id="outline-container-org189a70b" class="outline-3">
<h3 id="org189a70b">label</h3>
<div class="outline-text-3" id="text-org189a70b">
<p>
The default label for a node is its name. For <b>multiline labels</b>, any of the following escape symbols will kick off a new line
</p>
<ul class="org-ul">
<li><code>\n</code>: center aligned</li>
<li><code>\l</code>: left aligned</li>
<li><code>\r</code>: right aligned</li>
</ul>
<p>
The default font is 14pt Times Roman in black color. For other font families, sizes or colors, specify attributes <code>fontname</code>, <code>fontsize</code> or <code>fontcolor</code>, respectively.
</p>
</div>
</div>
<div id="outline-container-org44ba0c4" class="outline-3">
<h3 id="org44ba0c4">style</h3>
<div class="outline-text-3" id="text-org44ba0c4">
<ul class="org-ul">
<li><code>solid</code></li>
<li><code>dashed</code></li>
<li><code>dotted</code></li>
<li><code>bold</code></li>
<li><code>invis</code></li>
<li><code>filled</code>: shade inside the node using <code>fillcolor</code> <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.</li>
<li><code>diagonals</code></li>
<li><code>rounded</code></li>
</ul>
</div>
</div>
<div id="outline-container-org5219226" class="outline-3">
<h3 id="org5219226">port</h3>
<div class="outline-text-3" id="text-org5219226">
<p>
A node <i>port</i> is a point where edges can attach to a node<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. For any nodes, 8 ports are defined, <code>e</code>, <code>s</code>, <code>w</code>, <code>n</code>, <code>se</code>, <code>sw</code>, <code>ne</code>, <code>nw</code>. They can be used in either of the both ways.
</p>
<ul class="org-ul">
<li>Using the attribute of <code>headport</code> or <code>tailport</code> of a edge</li>
<li><code>NODE_NAME:PORT_NAME</code> <sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge302d2e" class="outline-2">
<h2 id="orge302d2e">edge</h2>
<div class="outline-text-2" id="text-orge302d2e">
<p>
A edge is created when nodes are joined by the edge operator
</p>
<ul class="org-ul">
<li>Directed graph: <code>-&gt;</code></li>
<li>Undirected graph: <code>--</code></li>
</ul>
</div>
<div id="outline-container-org4b26025" class="outline-3">
<h3 id="org4b26025">label</h3>
<div class="outline-text-3" id="text-org4b26025">
<p>
Edges are unlabeled by default. As the same as node label, an edge label can also be explicitly set using the <code>label</code> attribute. Specially, an edge can be given additional labels with attributes <code>headlabel</code> and <code>taillabel</code>. For edge labels, the font can be customized using the attributes <code>labelfontname</code>, <code>labelfontsize</code> and <code>labelfontcolor</code>.
</p>
</div>
</div>
<div id="outline-container-orgcaa160b" class="outline-3">
<h3 id="orgcaa160b">dir</h3>
<div class="outline-text-3" id="text-orgcaa160b">
<p>
This attribute is used to set arrowheads, which can be
</p>
<ul class="org-ul">
<li><code>forward</code> (default value)</li>
<li><code>back</code></li>
<li><code>both</code></li>
<li><code>none</code></li>
</ul>
</div>
</div>
<div id="outline-container-org0d25944" class="outline-3">
<h3 id="org0d25944">headport/tailport</h3>
<div class="outline-text-3" id="text-org0d25944">
<div class="org-src-container">
<pre class="src src-sh">NODE_NAME1 -&gt; NODE_NAME2 [headport/tailport=e/w/n/s/se/sw/ne/nw, OTHER_ATTRIBUTE=VALUE, ...];
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://www.graphviz.org/pdf/dotguide.pdf">http://www.graphviz.org/pdf/dotguide.pdf</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
If not set, the value of <code>color</code> will be adopted.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
If no port is specified, it is aimed at the node's center and the edge is clipped at the node's boundary.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For record-based nodes, it can be <code>NODE_NAME:FIELD_NAME:PORT_NAME</code>.
</p></div></div>


</div>
</div></div>
</body>
</html>